# t1-25-str_slicing
---
basic1 데이터에서 f4가 E로 시작하면서 부산에 살고 20대인 사람은 몇 명일까요?

In [1]:
import pandas as pd
df = pd.read_csv("./basic1.csv")
df.head()

     id   age city    f1  f2   f3    f4         f5
0  id01   2.0   서울   NaN   0  NaN  ENFJ  91.297791
1  id02   9.0   서울  70.0   1  NaN  ENFJ  60.339826
2  id03  27.0   서울  61.0   1  NaN  ISTJ  17.252986
3  id04  75.0   서울   NaN   2  NaN  INFP  52.667078
4  id05  24.0   서울  85.0   2  NaN  ISFJ  29.269869

In [8]:
cond1 = df['f4'].str[:1]=='E'
cond2 = df['age']>=20 
cond3 = df['age']<30
cond4 = df['city'] =='부산'
df = df[cond1 & cond2 & cond3 & cond4]

In [9]:
len(df)

0

# t1-26-str-contains
---
T1-26. menu컬럼에 "라떼" 키워드가 있는 데이터의 수는?

In [10]:
import pandas as pd
df = pd.read_csv("./payment.csv")
df.head()

       date  hour   menu  price
0  20221129    13   딸기라떼   4000
1  20221130    12   카페라떼   3000
2  20221201    14  바닐라라떼   3500
3  20221201    16   초코라떼   3500
4  20221202    17   모카라떼   3500

In [11]:
len(df[df['menu'].str[-2:] == '라떼'])

10

# T1-27-str-contains-replace
---
T1-27. 바닐라라떼 5점, 카페라떼 3점, 아메리카노 2점, 나머지 0점이다 총 메뉴의 점수를 더한 값은?

In [18]:
import pandas as pd
df = pd.read_csv("./payment.csv")
df.head(20)

        date  hour    menu  price
0   20221129    13    딸기라떼   4000
1   20221130    12    카페라떼   3000
2   20221201    14   바닐라라떼   3500
3   20221201    16    초코라떼   3500
4   20221202    17    모카라떼   3500
5   20221202    12   카라멜라떼   3500
6   20221203     8   챠이 라떼   3500
7   20221203     9   아메리카노   2000
8   20221203    15   오곡 라떼   4000
9   20221203    16   아메리카노   2000
10  20221225    10   아메리카노   2000
11  20221225    14  토피넛 라떼   4000
12  20221225    16   카페 라떼   3000

In [19]:
df['menu'] = df['menu'].str.replace(' ','')
cond1 = 5 * len(df[df['menu'].str.contains('바닐라라떼')])
cond2 = 3 * len(df[df['menu'].str.contains('카페라떼')])
cond3 = 2 * len(df[df['menu'].str.contains('아메리카노')])

In [20]:
cond1+cond2+cond3

17

# T1-28-value-counts-index
---
T1-28. 시간(hour)이 13시 이전(13시 포함하지 않음) 데이터 중 가장 많은 결제가 이루어진 날짜(date)는? (date 컬럼과 동일한 양식으로 출력)

In [13]:
import pandas as pd
df = pd.read_csv("./payment.csv")
df.head()

       date  hour   menu  price
0  20221129    13   딸기라떼   4000
1  20221130    12   카페라떼   3000
2  20221201    14  바닐라라떼   3500
3  20221201    16   초코라떼   3500
4  20221202    17   모카라떼   3500

In [16]:
df[df['hour']<13]['date'].value_counts().index[0]

20221203

# T1-29-datetime-format
---
T1-29. 12월인 데이터 수는?

In [35]:
import pandas as pd
df = pd.read_csv("./payment.csv")
df.head()

       date  hour   menu  price
0  20221129    13   딸기라떼   4000
1  20221130    12   카페라떼   3000
2  20221201    14  바닐라라떼   3500
3  20221201    16   초코라떼   3500
4  20221202    17   모카라떼   3500

In [40]:
df['date'] = pd.to_datetime(df['date'],format='%Y%m%d')

In [70]:
print(sum(df['date'].dt.month == 12))

0

# T1-30-datetime-percent
---
T1-30. 12월 25일 결제 금액(price)은 12월 총 결제금액의 몇 %인가? (정수로 출력)

In [86]:
import pandas as pd
df = pd.read_csv("./payment.csv")
df.head()

       date  hour   menu  price
0  20221129    13   딸기라떼   4000
1  20221130    12   카페라떼   3000
2  20221201    14  바닐라라떼   3500
3  20221201    16   초코라떼   3500
4  20221202    17   모카라떼   3500

In [87]:
df['date'] = pd.to_datetime(df['date'],format='%Y%m%d')

In [90]:
cond1 = df['date'].dt.month ==12
cond2 = df['date'].dt.day ==25

total = sum(df[cond1]['price'])
target = sum(df[cond1 & cond2]['price'])

In [91]:
int((target/total)*100)

26.08695652173913

# T1-31-sigmoid
---
[심화 학습] basic1 데이터에서 f2 값에 시그모이드 함수(그림 내 수식)를 적용하고, f4가 ISFJ인 (변경된)f2의 합을 구하시오! (소수점 둘째자리까지 출력, 반올림)

In [94]:
import pandas as pd
import numpy as np
df = pd.read_csv("./basic1.csv")
df.head()

     id   age city    f1  f2   f3    f4         f5
0  id01   2.0   서울   NaN   0  NaN  ENFJ  91.297791
1  id02   9.0   서울  70.0   1  NaN  ENFJ  60.339826
2  id03  27.0   서울  61.0   1  NaN  ISTJ  17.252986
3  id04  75.0   서울   NaN   2  NaN  INFP  52.667078
4  id05  24.0   서울  85.0   2  NaN  ISFJ  29.269869

In [95]:
def sigmoid(x):
    return 1 / (1 + np.exp(-x))

In [97]:
df['new'] = df['f2'].apply(sigmoid)

In [99]:
cond = df['f4'] == 'ISFJ'
round(df[cond]['new'].sum(),2)

7.15

# T1-32-relu
---
basic1 데이터에서 age 값에 ReLU 함수를 적용하고, city가 부산인 (변경된)age의 평균을 구하시오! (소수점 둘째자리까지 출력, 절사)

In [100]:
def relu(x):
    return np.maximum(0, x)

In [101]:
df['age'] = df['age'].apply(relu)

cond = df['city'] == "부산"
print(int(df[cond]['age'].mean()))

49